export const data = [
	[
		{
			title: 'На сколько хорошо знаешь C#?',
			imgUrl: 'public/QuizImg/2.webp'
		},
		{
			title: 'Что такое Куча?',
			variants: [
				'Область динамической памяти',
				' Именованная область памяти',
				'Куча переменных'
			],
			correct: 0
		},
		{
			title: 'Какие циклы существуют в языке C#?',
			variants: [
				'for, while',
				'for, while, do while, foreach',
				'for, while, do while'
			],
			correct: 1
		},
		{
			title: 'Что обозначает ключевое слово var?',
			variants: [
				'Устраивает «войну» между программами',
				'Обозначает что переменная имеет явный тип данных',
				'Обозначает что переменная без явного типа данных'
			],
			correct: 2
		},
		{
			title: 'Какие типы переменных существуют?',
			variants: [
				' int, char, bool, float, double',
				'int, char, bool, string',
				'Оба варианта верны',
				'Нет верного ответа'
			],
			correct: 2
		},
		{
			title: 'Что такое константа?',
			variants: [
				' Глобальная переменная',
				'Переменная которая может быть изменена в любое время',
				' Переменная значение которой нельзя изменить',
				'Нет верного ответа'
			],
			correct: 2
		},
		{
			title: 'Что такое константа?',
			variants: [' end', 'out', ' return '],
			correct: 2
		}
	],
	[
		{
			title: 'Вопросы по C++',
			imgUrl: 'public/QuizImg/1.webp'
		},
		{
			title:
				'Функция вычисляет произведение двух чисел. Исходные данные вводятся с клавиатуры. Какие проверки целесообразно ввести в программе?',
			variants: [
				'проверка, что исходные данные являются числами',
				' проверки не нужны, все возможные ошибки отловит компилятор',
				'проверка исходных данных на равенство нулю'
			],
			correct: 0
		},
		{
			title: 'Для чего предназначен оператор namespace?',
			variants: [
				'для использования классов, переменных и функций из других модулей программы без использования заголовочных файлов',
				'для заключения в группу объявлений классов, переменных и функций в отдельный контекст со своим именем',
				'для заключения в группу объявлений классов, переменных и функций для использования только в текущем модуле'
			],
			correct: 1
		},
		{
			title:
				' Какой из компонентов может входить в интегрированную среду программирования?',
			variants: ['наладчик', 'доводчик', 'отладчик '],
			correct: 2
		},
		{
			title:
				'Какой из компонентов может входить в интегрированную среду программирования?',
			variants: [
				'текстовый редактор',
				'текстовый директор',
				'текстовый модератор',
				'Нет верного ответа'
			],
			correct: 1
		},
		{
			title:
				'Какой из компонентов может входить в интегрированную среду программирования:?',
			variants: ['регулятор', 'доминатор', 'компилятор', 'Нет верного ответа'],
			correct: 2
		},
		{
			title:
				'Чему будет равен результат вычисления выражения: int d=5; bool b = true, c; c = (!b||(d>3))?',
			variants: ['Ошибка компилятора', 'false', ' true '],
			correct: 2
		}
	],
	[
		{
			title: 'Профи по Js?',
			imgUrl:
				'public/QuizImg/68747470733a2f2f63646e2e66726565626965737570706c792e636f6d2f6c6f676f732f6c617267652f32782f6e6f64656a732d69636f6e2d6c6f676f2d706e672d7472616e73706172656e742e706e67.png'
		},
		{
			title: 'Какое ключевое слово позволяет создавать объекты общего вида?',
			variants: ['object ', 'this', 'prototype'],
			correct: 0
		},
		{
			title: 'Какая функция позволяет очищать конечную анимацию?',
			variants: ['setInterval', 'clearTimeout', 'setTimeout'],
			correct: 1
		},
		{
			title: 'Что, из ниже перечисленного, относится к событию?',
			variants: [
				' начало загрузки web-страницы',
				'сохранение кодировки пользователем',
				'завершение загрузки web-страницы '
			],
			correct: 2
		},
		{
			title: 'Что, из ниже перечисленного, относится к событию?',
			variants: [
				'изменение кодировки пользователем',
				'начало загрузки web-страницы',
				'сохранение кодировки пользователем',
				'Нет верного ответа'
			],
			correct: 0
		},
		{
			title:
				'Какой оператор служит для создания нового экземпляра из класса однотипных объектов?',
			variants: ['this', 'prototype', 'new ', 'Нет верного ответа'],
			correct: 2
		},
		{
			title:
				'Объекты, отвечающие за то, что содержится на Web-странице в окне браузера, называются?',
			variants: ['пользовательскими', 'клиентскими ', ' встроенными '],
			correct: 1
		}
	],
	[
		{
			title: 'Quiz по React.js',
			imgUrl: 'public/logo512.png'
		},
		{
			title: 'React - это ... ?',
			variants: ['библиотека', 'фреймворк', 'приложение'],
			correct: 0
		},
		{
			title: 'Компонент - это ... ',
			variants: [
				'приложение',
				'часть приложения или страницы',
				'то, что я не знаю что такое'
			],
			correct: 1
		},
		{
			title: 'Что такое JSX?',
			variants: [
				'Это простой HTML',
				'Это функция',
				'Это тот же HTML, но с возможностью выполнять JS-код'
			],
			correct: 2
		}
	],[
		{
			title: 'На сколько хорошо знаешь C#?',
			imgUrl: 'public/QuizImg/2.webp'
		},
		{
			title: 'Что такое Куча?',
			variants: [
				'Область динамической памяти',
				' Именованная область памяти',
				'Куча переменных'
			],
			correct: 0
		},
		{
			title: 'Какие циклы существуют в языке C#?',
			variants: [
				'for, while',
				'for, while, do while, foreach',
				'for, while, do while'
			],
			correct: 1
		},
		{
			title: 'Что обозначает ключевое слово var?',
			variants: [
				'Устраивает «войну» между программами',
				'Обозначает что переменная имеет явный тип данных',
				'Обозначает что переменная без явного типа данных'
			],
			correct: 2
		},
		{
			title: 'Какие типы переменных существуют?',
			variants: [
				' int, char, bool, float, double',
				'int, char, bool, string',
				'Оба варианта верны',
				'Нет верного ответа'
			],
			correct: 3
		},
		{
			title: 'Что такое константа?',
			variants: [
				' Глобальная переменная',
				'Переменная которая может быть изменена в любое время',
				' Переменная значение которой нельзя изменить',
				'Нет верного ответа'
			],
			correct: 2
		},
		{
			title: 'Что такое константа?',
			variants: [' end', 'out', ' return '],
			correct: 2
		}
	],
	[
		{
			title: 'Вопросы по C++',
			imgUrl: 'public/QuizImg/1.webp'
		},
		{
			title:
				'Функция вычисляет произведение двух чисел. Исходные данные вводятся с клавиатуры. Какие проверки целесообразно ввести в программе?',
			variants: [
				'проверка, что исходные данные являются числами',
				' проверки не нужны, все возможные ошибки отловит компилятор',
				'проверка исходных данных на равенство нулю'
			],
			correct: 0
		},
		{
			title: 'Для чего предназначен оператор namespace?',
			variants: [
				'для использования классов, переменных и функций из других модулей программы без использования заголовочных файлов',
				'для заключения в группу объявлений классов, переменных и функций в отдельный контекст со своим именем',
				'для заключения в группу объявлений классов, переменных и функций для использования только в текущем модуле'
			],
			correct: 1
		},
		{
			title:
				' Какой из компонентов может входить в интегрированную среду программирования?',
			variants: ['наладчик', 'доводчик', 'отладчик '],
			correct: 2
		},
		{
			title:
				'Какой из компонентов может входить в интегрированную среду программирования?',
			variants: [
				'текстовый редактор',
				'текстовый директор',
				'текстовый модератор',
				'Нет верного ответа'
			],
			correct: 1
		},
		{
			title:
				'Какой из компонентов может входить в интегрированную среду программирования:?',
			variants: ['регулятор', 'доминатор', 'компилятор', 'Нет верного ответа'],
			correct: 2
		},
		{
			title:
				'Чему будет равен результат вычисления выражения: int d=5; bool b = true, c; c = (!b||(d>3))?',
			variants: ['Ошибка компилятора', 'false', ' true '],
			correct: 2
		}
	],
	[
		{
			title: 'Профи по Js?',
			imgUrl:
				'public/QuizImg/68747470733a2f2f63646e2e66726565626965737570706c792e636f6d2f6c6f676f732f6c617267652f32782f6e6f64656a732d69636f6e2d6c6f676f2d706e672d7472616e73706172656e742e706e67.png'
		},
		{
			title: 'Какое ключевое слово позволяет создавать объекты общего вида?',
			variants: ['object ', 'this', 'prototype'],
			correct: 0
		},
		{
			title: 'Какая функция позволяет очищать конечную анимацию?',
			variants: ['setInterval', 'clearTimeout', 'setTimeout'],
			correct: 1
		},
		{
			title: 'Что, из ниже перечисленного, относится к событию?',
			variants: [
				' начало загрузки web-страницы',
				'сохранение кодировки пользователем',
				'завершение загрузки web-страницы '
			],
			correct: 2
		},
		{
			title: 'Что, из ниже перечисленного, относится к событию?',
			variants: [
				'изменение кодировки пользователем',
				'начало загрузки web-страницы',
				'сохранение кодировки пользователем',
				'Нет верного ответа'
			],
			correct: 0
		},
		{
			title:
				'Какой оператор служит для создания нового экземпляра из класса однотипных объектов?',
			variants: ['this', 'prototype', 'new ', 'Нет верного ответа'],
			correct: 2
		},
		{
			title:
				'Объекты, отвечающие за то, что содержится на Web-странице в окне браузера, называются?',
			variants: ['пользовательскими', 'клиентскими ', ' встроенными '],
			correct: 1
		}
	],
	[
		{
			title: 'Quiz по React.js',
			imgUrl: 'public/logo512.png'
		},
		{
			title: 'React - это ... ?',
			variants: ['библиотека', 'фреймворк', 'приложение'],
			correct: 0
		},
		{
			title: 'Компонент - это ... ',
			variants: [
				'приложение',
				'часть приложения или страницы',
				'то, что я не знаю что такое'
			],
			correct: 1
		},
		{
			title: 'Что такое JSX?',
			variants: [
				'Это простой HTML',
				'Это функция',
				'Это тот же HTML, но с возможностью выполнять JS-код'
			],
			correct: 2
		}
	],
]
